app/controllers/api/v1/workers_controller.rb

INSERT INTO `workers` (`name`, `company_name`, `email`) VALUES ('Vika', 'Origo', 'vika@baby.com')
---
      def create
        worker = Worker.create!(worker_params)

DELETE FROM `workers` WHERE `workers`.`id` = 4
SELECT  `workers`.* FROM `workers` WHERE `workers`.`id` = 4 LIMIT 1
---
      def destroy
        Worker.find(params[:id]).destroy