app/controllers/api/v1/work_orders_controller.rb

      def create
        work_order = WorkOrder.create!(work_order_params)
---
INSERT INTO `work_orders` (`title`, `description`, `deadline`) VALUES ('princess', 'to throw tantrums', '2100-01-01 00:00:00')

      def assign_worker
        work_order = WorkOrder.find(params[:id])
        worker = Worker.find(worker_id)
---
SELECT  `work_orders`.* FROM `work_orders` WHERE `work_orders`.`id` = 3 LIMIT 1
SELECT  `workers`.* FROM `workers` WHERE `workers`.`id` = 5 LIMIT 1